var searchData = [
'더바디샵',
'오휘/후',
'키엘',
'스와치그룹 멀티샵',
'TOPS',
'하우스오브 쌤소나이트',
'설화수',
'SK-II',
'헤라',
'디올',
'빌리프',
'메이크업포에버',
'베네피트',
'제이에스티나',
'젬크레인',
'스와로브스키',
'골등듀',
'자파즈',
'시즌잡화 SEASON',
'엔클라인',
'숨37',
'클라랑스',
'비다벨로',
'동인비',
'불가리 퍼퓸',
'에스티로더',
'샤넬',
'대니 맥켄지',
'스톤헨지',
'파슬',
'갤러리아 클락',
'투바니',
'피에르가르멩',
'닥스',
'루이까또즈',
'비오템',
'랑콤',
'메트로시티',
'폴바셋',
'토모톰스',
'에고이스트',
'이프네',
'올리브데올리브',
'듀엘',
'주브',
'베네통',
'르니앤맥코이',
'시슬리',
'톰보이',
'ab f.z.',
'담다',
'마리앤',
'SOUP',
'난닝구',
'이엔씨',
'폴스부띠끄 / 세컨스킨',
'GGPX',
'오즈세컨',
'스튜디오럭스',
'꾸즈',
'밸리걸',
'루코루코',
'리안뉴욕',
'르피타',
'온앤온',
'반에이크',
'탑걸',
'케네스레이디',
'보브',
'라인',
'타미힐피거여성',
'해지스레이디스',
'빈폴 레이디스',
'쥬시쥬디',
'잇미샤',
'로엠',
'JJ지고트',
'리스트',
'시크릿우먼',
'마담포라',
'닥스1',
'리본',
'비비안',
'비너스',
'와코루',
'금강/랜드로바',
'세라젬(오가다)',
'부르다문',
'시스막스',
'에스투피',
'벨리시앙',
'에스깔리에',
'정호진',
'로잔',
'뽀뜨레',
'베띠앙뜨',
'에스콰이아',
'엘칸토',
'바이네르',
'닥스2',
'소다',
'루치아노최',
'빈루즈',
'이동수',
'리베도',
'올리비아하슬러',
'엠씨',
'요하네스',
'미소페',
'마겟',
'트리아나',
'리아트',
'탠디',
'몬테밀라노',
'레노마레이디',
'크로커다일',
'더람',
'우바',
'아이잗바바',
'크레송',
'근화모피',
'휴테크',]

function testLocation(value){
    let end = '';
    for (key in floor1) {
        if (floor1[key] == value) {
            end = key
        }
    }
    for (key in floor2) {
        if (floor2[key] == value) {
            end = key
        }
    }
    for (key in floor3) {
        if (floor3[key] == value) {
            end = key
        }
    }

  $('#'+modalFlag+'Code').val(end);
  $('#'+modalFlag).val(value);

  modal.style.display = 'none';
    
}
var findPath = $('#findpath');

$('html').on('click', '#findpath', function(e){
    var start = $('#startCode').val();
    var end = $('#endCode').val();
    
    location.href = `/map?start=${start}&end=${end}`;
})

